node {
  name: "DAGM/training"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
}
node {
  name: "DAGM/input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 32
        }
        dim {
          size: 32
        }
        dim {
          size: 1
        }
      }
    }
  }
}
node {
  name: "DAGM/Placeholder"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000\001\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10127393901348114
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10127393901348114
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 777
    }
  }
  attr {
    key: "seed2"
    value {
      i: 6
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/max"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/RandomUniform"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Initializer/random_uniform"
  op: "Add"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/mul"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 1
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Assign"
  op: "Assign"
  input: "DAGM/conv2d/kernel"
  input: "DAGM/conv2d/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/read"
  op: "Identity"
  input: "DAGM/conv2d/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-06
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "DAGM/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "DAGM/conv2d/kernel/Regularizer/l2_regularizer/scale"
  input: "DAGM/conv2d/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DAGM/conv2d/Conv2D"
  op: "Conv2D"
  input: "DAGM/input"
  input: "DAGM/conv2d/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization/gamma/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization/gamma"
  input: "DAGM/batch_normalization/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/gamma/read"
  op: "Identity"
  input: "DAGM/batch_normalization/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization/beta/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization/beta"
  input: "DAGM/batch_normalization/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/beta/read"
  op: "Identity"
  input: "DAGM/batch_normalization/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_mean/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization/moving_mean"
  input: "DAGM/batch_normalization/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_mean/read"
  op: "Identity"
  input: "DAGM/batch_normalization/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_variance/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization/moving_variance"
  input: "DAGM/batch_normalization/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/moving_variance/read"
  op: "Identity"
  input: "DAGM/batch_normalization/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Switch"
  op: "Switch"
  input: "DAGM/training"
  input: "DAGM/training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/switch_t"
  op: "Identity"
  input: "DAGM/batch_normalization/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/switch_f"
  op: "Identity"
  input: "DAGM/batch_normalization/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/pred_id"
  op: "Identity"
  input: "DAGM/training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Const"
  op: "Const"
  input: "^DAGM/batch_normalization/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Const_1"
  op: "Const"
  input: "^DAGM/batch_normalization/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "DAGM/conv2d/Conv2D"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "DAGM/batch_normalization/gamma/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "DAGM/batch_normalization/beta/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch:1"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch_1:1"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm/Switch_2:1"
  input: "DAGM/batch_normalization/cond/Const"
  input: "DAGM/batch_normalization/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "DAGM/conv2d/Conv2D"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d/Conv2D"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "DAGM/batch_normalization/gamma/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "DAGM/batch_normalization/beta/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "DAGM/batch_normalization/moving_mean/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "DAGM/batch_normalization/moving_variance/read"
  input: "DAGM/batch_normalization/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_1"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_2"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_3"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Merge"
  op: "Merge"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Merge_1"
  op: "Merge"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1:1"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization/cond/Merge_2"
  op: "Merge"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm_1:2"
  input: "DAGM/batch_normalization/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims"
  op: "ExpandDims"
  input: "DAGM/batch_normalization/ExpandDims/input"
  input: "DAGM/batch_normalization/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims_1/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/ExpandDims_1"
  op: "ExpandDims"
  input: "DAGM/batch_normalization/ExpandDims_1/input"
  input: "DAGM/batch_normalization/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DAGM/batch_normalization/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/Reshape"
  op: "Reshape"
  input: "DAGM/training"
  input: "DAGM/batch_normalization/Reshape/shape"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DAGM/batch_normalization/Select"
  op: "Select"
  input: "DAGM/batch_normalization/Reshape"
  input: "DAGM/batch_normalization/ExpandDims"
  input: "DAGM/batch_normalization/ExpandDims_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization/Squeeze"
  op: "Squeeze"
  input: "DAGM/batch_normalization/Select"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "squeeze_dims"
    value {
      list {
        i: 0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg/read"
  op: "Identity"
  input: "DAGM/batch_normalization/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg/Sub"
  op: "Sub"
  input: "DAGM/batch_normalization/AssignMovingAvg/read"
  input: "DAGM/batch_normalization/cond/Merge_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg/Mul"
  op: "Mul"
  input: "DAGM/batch_normalization/AssignMovingAvg/Sub"
  input: "DAGM/batch_normalization/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg"
  op: "AssignSub"
  input: "DAGM/batch_normalization/moving_mean"
  input: "DAGM/batch_normalization/AssignMovingAvg/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg_1/read"
  op: "Identity"
  input: "DAGM/batch_normalization/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg_1/Sub"
  op: "Sub"
  input: "DAGM/batch_normalization/AssignMovingAvg_1/read"
  input: "DAGM/batch_normalization/cond/Merge_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg_1/Mul"
  op: "Mul"
  input: "DAGM/batch_normalization/AssignMovingAvg_1/Sub"
  input: "DAGM/batch_normalization/Squeeze"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization/AssignMovingAvg_1"
  op: "AssignSub"
  input: "DAGM/batch_normalization/moving_variance"
  input: "DAGM/batch_normalization/AssignMovingAvg_1/Mul"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: false
    }
  }
}
node {
  name: "DAGM/Relu"
  op: "Relu"
  input: "DAGM/batch_normalization/cond/Merge"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/shape"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 4
          }
        }
        tensor_content: "\003\000\000\000\003\000\000\000@\000\000\000@\000\000\000"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/min"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.07216878235340118
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/max"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.07216878235340118
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 777
    }
  }
  attr {
    key: "seed2"
    value {
      i: 75
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/sub"
  op: "Sub"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/max"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform/mul"
  op: "Mul"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/RandomUniform"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Initializer/random_uniform"
  op: "Add"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/mul"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 3
        }
        dim {
          size: 3
        }
        dim {
          size: 64
        }
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/Assign"
  op: "Assign"
  input: "DAGM/conv2d_1/kernel"
  input: "DAGM/conv2d_1/kernel/Initializer/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/conv2d_1/kernel/read"
  op: "Identity"
  input: "DAGM/conv2d_1/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_2/kernel/Regularizer/l2_regularizer/scale"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 9.999999747378752e-06
      }
    }
  }
}
node {
  name: "DAGM/conv2d_2/kernel/Regularizer/l2_regularizer/L2Loss"
  op: "L2Loss"
  input: "DAGM/conv2d_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_2/kernel/Regularizer/l2_regularizer"
  op: "Mul"
  input: "DAGM/conv2d_2/kernel/Regularizer/l2_regularizer/scale"
  input: "DAGM/conv2d_2/kernel/Regularizer/l2_regularizer/L2Loss"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_1/kernel"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_2/dilation_rate"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "DAGM/conv2d_2/Conv2D"
  op: "Conv2D"
  input: "DAGM/Relu"
  input: "DAGM/conv2d_1/kernel/read"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "padding"
    value {
      s: "SAME"
    }
  }
  attr {
    key: "strides"
    value {
      list {
        i: 1
        i: 1
        i: 1
        i: 1
      }
    }
  }
  attr {
    key: "use_cudnn_on_gpu"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/gamma/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/gamma"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/gamma/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization_1/gamma"
  input: "DAGM/batch_normalization_1/gamma/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/gamma/read"
  op: "Identity"
  input: "DAGM/batch_normalization_1/gamma"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/beta/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/beta"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/beta/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization_1/beta"
  input: "DAGM/batch_normalization_1/beta/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/beta/read"
  op: "Identity"
  input: "DAGM/batch_normalization_1/beta"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_mean/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_mean"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_mean"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_mean"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_mean/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization_1/moving_mean"
  input: "DAGM/batch_normalization_1/moving_mean/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_mean"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_mean/read"
  op: "Identity"
  input: "DAGM/batch_normalization_1/moving_mean"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_variance/Initializer/ones"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_variance"
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 64
          }
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_variance"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_variance"
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 64
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_variance/Assign"
  op: "Assign"
  input: "DAGM/batch_normalization_1/moving_variance"
  input: "DAGM/batch_normalization_1/moving_variance/Initializer/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_variance"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_1/moving_variance/read"
  op: "Identity"
  input: "DAGM/batch_normalization_1/moving_variance"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Switch"
  op: "Switch"
  input: "DAGM/training"
  input: "DAGM/training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/switch_t"
  op: "Identity"
  input: "DAGM/batch_normalization_2/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/switch_f"
  op: "Identity"
  input: "DAGM/batch_normalization_2/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/pred_id"
  op: "Identity"
  input: "DAGM/training"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Const"
  op: "Const"
  input: "^DAGM/batch_normalization_2/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Const_1"
  op: "Const"
  input: "^DAGM/batch_normalization_2/cond/switch_t"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
          }
        }
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch"
  op: "Switch"
  input: "DAGM/conv2d_2/Conv2D"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_2/Conv2D"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch_1"
  op: "Switch"
  input: "DAGM/batch_normalization_1/gamma/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch_2"
  op: "Switch"
  input: "DAGM/batch_normalization_1/beta/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm"
  op: "FusedBatchNorm"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch:1"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch_1:1"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm/Switch_2:1"
  input: "DAGM/batch_normalization_2/cond/Const"
  input: "DAGM/batch_normalization_2/cond/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: true
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch"
  op: "Switch"
  input: "DAGM/conv2d_2/Conv2D"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/conv2d_2/Conv2D"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1"
  op: "Switch"
  input: "DAGM/batch_normalization_1/gamma/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/gamma"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2"
  op: "Switch"
  input: "DAGM/batch_normalization_1/beta/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/beta"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3"
  op: "Switch"
  input: "DAGM/batch_normalization_1/moving_mean/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_mean"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"
  op: "Switch"
  input: "DAGM/batch_normalization_1/moving_variance/read"
  input: "DAGM/batch_normalization_2/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@DAGM/batch_normalization_1/moving_variance"
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1"
  op: "FusedBatchNorm"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_1"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_2"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_3"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1/Switch_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
  attr {
    key: "epsilon"
    value {
      f: 0.0010000000474974513
    }
  }
  attr {
    key: "is_training"
    value {
      b: false
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Merge"
  op: "Merge"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Merge_1"
  op: "Merge"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1:1"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm:1"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/cond/Merge_2"
  op: "Merge"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm_1:2"
  input: "DAGM/batch_normalization_2/cond/FusedBatchNorm:2"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.009999999776482582
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims"
  op: "ExpandDims"
  input: "DAGM/batch_normalization_2/ExpandDims/input"
  input: "DAGM/batch_normalization_2/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims_1/input"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims_1/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/ExpandDims_1"
  op: "ExpandDims"
  input: "DAGM/batch_normalization_2/ExpandDims_1/input"
  input: "DAGM/batch_normalization_2/ExpandDims_1/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/Reshape/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "DAGM/batch_normalization_2/Reshape"
  op: "Reshape"
  input: "DAGM/training"
  input: "DAGM/batch_normalization_2/Reshape/shape"
  attr {
